In [1]:
import sqlalchemy
import pandas as pd
sqlalchemy.__version__

'1.4.39'

In [2]:
%load_ext sql

In [3]:
#engine = sqlalchemy.create_engine("mysql+mysqlconnector://Eugen:2413@localhost:3306/Test")

In [4]:
#connection = engine.connect()

In [5]:
%sql mysql+mysqlconnector://Eugen:2413@localhost/Test

'Connected: Eugen@Test'

In [6]:
%%sql

#DROP TABLE car;

CREATE TABLE car (carID INT AUTO_INCREMENT PRIMARY KEY,
                  make VARCHAR(20), 
                  model VARCHAR(20), 
                  owner VARCHAR(30), 
                  year YEAR);

 * mysql+mysqlconnector://Eugen:***@localhost/Test
0 rows affected.
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'car' already exists
[SQL: CREATE TABLE car (carID INT AUTO_INCREMENT PRIMARY KEY,
                  make VARCHAR(20),
                  model VARCHAR(20),
                  owner VARCHAR(30),
                  year YEAR);]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [7]:
%%sql 

DESCRIBE car;

 * mysql+mysqlconnector://Eugen:***@localhost/Test
5 rows affected.

[('carID', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('make', 'varchar(20)', 'YES', '', None, ''),
 ('model', 'varchar(20)', 'YES', '', None, ''),
 ('owner', 'varchar(30)', 'YES', '', None, ''),
 ('year', 'year', 'YES', '', None, '')]

In [8]:
%%sql 

INSERT INTO car (make, model, owner, year)
VALUES('nissan', 'qashqai', 'demetris trihinas', '2015');

 * mysql+mysqlconnector://Eugen:***@localhost/Test
1 rows affected.

[]

In [9]:
%sql SELECT * FROM car

 * mysql+mysqlconnector://Eugen:***@localhost/Test
2 rows affected.

[(1, 'nissan', 'qashqai', 'demetris trihinas', 2015),
 (2, 'nissan', 'qashqai', 'demetris trihinas', 2015)]

In [10]:
#employees.sql file imported

In [11]:
%sql mysql+mysqlconnector://Eugen:2413@localhost/employees

'Connected: Eugen@employees'

In [12]:
%%sql

SELECT *

FROM employees

LIMIT 5;

   mysql+mysqlconnector://Eugen:***@localhost/Test
 * mysql+mysqlconnector://Eugen:***@localhost/employees
5 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26)),
 (10002, datetime.date(1964, 6, 2), 'Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21)),
 (10003, datetime.date(1959, 12, 3), 'Parto', 'Bamford', 'M', datetime.date(1986, 8, 28)),
 (10004, datetime.date(1954, 5, 1), 'Chirstian', 'Koblick', 'M', datetime.date(1986, 12, 1)),
 (10005, datetime.date(1955, 1, 21), 'Kyoichi', 'Maliniak', 'M', datetime.date(1989, 9, 12))]

In [14]:
emps_list = %sql SELECT first_name,last_name FROM employees WHERE gender = 'F' AND hire_date >= '2000-01-01';

   mysql+mysqlconnector://Eugen:***@localhost/Test
 * mysql+mysqlconnector://Eugen:***@localhost/employees
7 rows affected.

In [15]:
emps_list_df = pd.DataFrame(emps_list)

In [16]:
emps_list_df

          0           1
0     Seshu    Rathonyi
1     Randi        Luit
2     Ennio      Alblas
3   Volkmar       Perko
4    Xuejun  Benzmuller
5     Jaana    Verspoor
6  Hideyuki   Delgrande

In [17]:
%%sql

SELECT e.first_name, e.last_name, s.salary 
FROM employees e JOIN salaries s ON e.emp_no=s.emp_no 
WHERE s.salary > 150000
ORDER BY s.salary DESC;

   mysql+mysqlconnector://Eugen:***@localhost/Test
 * mysql+mysqlconnector://Eugen:***@localhost/employees
36 rows affected.

[('Tokuyasu', 'Pesch', 158220),
 ('Tokuyasu', 'Pesch', 157821),
 ('Honesty', 'Mukaidono', 156286),
 ('Xiahua', 'Whitcomb', 155709),
 ('Sanjai', 'Luders', 155513),
 ('Tsutomu', 'Alameldin', 155377),
 ('Tsutomu', 'Alameldin', 155190),
 ('Tsutomu', 'Alameldin', 154888),
 ('Tsutomu', 'Alameldin', 154885),
 ('Willard', 'Baca', 154459),
 ('Lidong', 'Meriste', 154376),
 ('Sanjai', 'Luders', 154227),
 ('Charmane', 'Griswold', 153715),
 ('Tokuyasu', 'Pesch', 153458),
 ('Tokuyasu', 'Pesch', 153166),
 ('Weijing', 'Chenoweth', 152710),
 ('Weicheng', 'Hatcliff', 152687),
 ('Honesty', 'Mukaidono', 152576),
 ('Shin', 'Birdsall', 152412),
 ('Mitsuyuki', 'Stanfel', 152220),
 ('Lidong', 'Meriste', 152208),
 ('Xiahua', 'Whitcomb', 151929),
 ('Willard', 'Baca', 151768),
 ('Charmane', 'Griswold', 151596),
 ('Lidong', 'Meriste', 151565),
 ('Tsutomu', 'Alameldin', 151484),
 ('Tokuyasu', 'Pesch', 151115),
 ('Weijing', 'Chenoweth', 151080),
 ('Weicheng', 'Hatcliff', 150994),
 ('Lidong', 'Meriste', 150993),
 ('Honesty', 'Mukaidono', 150754),
 ('Mohammed', 'Moehrke', 150740),
 ('Shin', 'Birdsall', 150467),
 ('Sanjai', 'Luders', 150378),
 ('Ibibia', 'Junet', 150345),
 ('Lansing', 'Kambil', 150052)]